ezois_ka/oooezoiskaobmen/src/Reports/СправкаРасчетАмортизацииНМА2_4/СправкаРасчетАмортизацииНМА2_4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СправкаРасчетАмортизацииНМА2_4</name>
</mdclass:Report>

ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/СтоимостьНМА/СтоимостьНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьНМА</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходовНУПриИНВ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиСтоимости</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиСтоимостиРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПриростСтоимости</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПриростСтоимостиРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительнаяСтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПримененияЦелевогоФинансирования</name>
    <type>
      <types>EnumRef.ВариантыПримененияЦелевогоФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаПрошлыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаТекущийПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаПрошлыйПериодБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаТекущийПериодБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокОбесцененияРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокОбесцененияУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоначисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоначислениеБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаУУ</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/УчетнаяПолитикаБухУчета/УчетнаяПолитикаБухУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаБухУчета</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВедетсяУчетПостоянныхИВременныхРазниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСчет40</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗабалансовыйУчетТМЦВЭксплуатации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СборкаТоваровЧерезСчет20</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВзаимозачетЧерезСчет76</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьФормироватьРезервыПоСомнительнымДолгамБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПериодичностьРезервовПоСомнительнымДолгамБУ</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ВидРазницПБУ18РезервовПоСомнительнымДолгам</name>
    <type>
      <types>EnumRef.ВидыРазницПБУ18</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПорядокОценкиЗадолженности</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПроводкиПоРаботникам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяФСБУ6</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяФСБУ14</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетНИОКРПоФСБУ26</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовПоИсследованиям</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовПоИсследованиям</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ВариантУчетаОтложенногоНалога</name>
    <type>
      <types>EnumRef.ВариантыУчетаОтложенногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииОС</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииАренда</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииНМА</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаЗаполненияБухОтчетности</name>
    <type>
      <types>CatalogRef.НастройкиЗаполненияБухОтчетности</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСписатьСтоимостьТМЦВЭксплуатации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписыватьСтоимостьМалоценныхТМЦНаРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовДляСписанияМалоценныхТМЦ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаСписанияМалоценныхТМЦ</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>РеформацияБалансаВРазрезеОП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетПродукцииПереработчикаНа20Счете</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодПереоценкиОС</name>
    <type>
      <types>EnumRef.МетодыПереоценкиВНА</types>
    </type>
  </resources>
  <resources>
    <name>МетодПереоценкиНМА</name>
    <type>
      <types>EnumRef.МетодыПереоценкиВНА</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиУчетаНалогаНаПрибыль/НастройкиУчетаНалогаНаПрибыль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаНалогаНаПрибыль</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ПорядокУплатыАвансовПоНалогуНаПрибыль</name>
    <type>
      <types>EnumRef.ПорядокУплатыАвансовПоНалогуНаПрибыль</types>
    </type>
  </resources>
  <resources>
    <name>БазаРаспределенияКосвенныхРасходовПоВидамДеятельности</name>
    <type>
      <types>EnumRef.БазыРаспределенияКосвенныхРасходовПоВидамДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгамНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьРезервовПоСомнительнымДолгамНУ</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьВСоставНалоговыхРасходовАрендныеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизацииНУ</name>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойВариантНалогообложенияПрибыли</name>
    <type>
      <types>CatalogRef.ВариантыНалогообложенияПрибыли</types>
    </type>
  </resources>
  <resources>
    <name>РаздельныйУчетПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательОпределенияДолиПрибыли</name>
    <type>
      <types>EnumRef.ПоказателиДляОпределенияДолиПрибыли</types>
    </type>
  </resources>
  <resources>
    <name>УплачиватьНалогПоГруппамОбособленныхПодразделений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНезависимогоПризнанияДоходовРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяФедеральныйИНВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоляРасходовИНВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальнаяСтавкаИНВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПереносаВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Reports/СправкаРасчетАмортизацииНМА2_4/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	ЗначенияОтбораДанных = ПолучитьЗначенияОтбораДанных(НастройкиОсновнойСхемы);
	
	ТекстСообщения = НСтр("ru = 'Отчет не поддерживает получение данных до даты начала учета внеоборотных активов версии 2.4 - %1.
                           |Необходимо воспользоваться отчетом ""Регламентированный учет"" - ""Справки-расчеты"" - ""Справка-расчет амортизации"".'");

	Если НЕ ЗначениеЗаполнено(ЗначенияОтбораДанных.ДокументРасчетаАмортизации) Тогда
		ВнеоборотныеАктивыСлужебный.ПроверитьПериодОтчетаВерсии24(
			ЗначенияОтбораДанных.НачалоПериода, 
			ЗначенияОтбораДанных.ОкончаниеПериода, 
			ТекстСообщения,
			Отказ); 
	КонецЕсли; 
		
	Если НЕ ЗначенияОтбораДанных.ПоказатьРасчетБУ
		И НЕ ЗначенияОтбораДанных.ПоказатьРасчетНУ
		И НЕ ЗначенияОтбораДанных.ПоказатьРасчетУУ Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо выбрать какие данные нужно получить: БУ, НУ, УУ.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	УстановитьТекстЗапроса(СхемаКомпоновкиДанных);
	
	ЗначенияОтбораДанных = ПолучитьЗначенияОтбораДанных(НастройкиОсновнойСхемы);
	
	УстановитьПараметрыОтчета(ЗначенияОтбораДанных, НастройкиОсновнойСхемы);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОсновнойСхемы, ДанныеРасшифровки);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, Неопределено, ДанныеРасшифровки, Истина);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
	
	ДобавитьИнформационноеСообщениеВШапку(ДокументРезультат, ЗначенияОтбораДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - См. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	
	Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма - ФормаКлиентскогоПриложения - Форма отчета:
//   	* Параметры - Структура - может содержать свойства:
//				** ПараметрКоманды - Произвольный -
//				** ОписаниеКоманды - Структура - 
//   Отказ - Булево - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Булево - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = ЭтаФорма.Параметры; 
	
	Если Параметры.Свойство("ПараметрКоманды")
		И Параметры.Свойство("ОписаниеКоманды")
		И Параметры.ОписаниеКоманды.Свойство("ДополнительныеПараметры") Тогда 
		
		ЭтаФорма.ФормаПараметры.КлючНазначенияИспользования = Параметры.ОписаниеКоманды.ДополнительныеПараметры.ИмяКоманды;
		Параметры.КлючНазначенияИспользования = Параметры.ОписаниеКоманды.ДополнительныеПараметры.ИмяКоманды;
		
		Если Параметры.ОписаниеКоманды.ДополнительныеПараметры.ИмяКоманды = "СправкаРасчетПоНМА" Тогда
			ЭтаФорма.ФормаПараметры.Отбор.Вставить("НематериальныйАктив", Параметры.ПараметрКоманды);
		ИначеЕсли Параметры.ОписаниеКоманды.ДополнительныеПараметры.ИмяКоманды = "СправкаРасчетПоДокументуАмортизацииНМА" Тогда
			ЭтаФорма.ФормаПараметры.Отбор.Вставить("ДокументРасчетаАмортизации", Параметры.ПараметрКоманды);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//
// См. синтакс-помощник "Расширение управляемой формы для отчета.ПриЗагрузкеВариантаНаСервере" в синтакс-помощнике.
//
Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	Отчет = Форма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек; // КомпоновщикНастроекКомпоновкиДанных - 
	
	УстановитьПериодОтчета(Форма, КомпоновщикНастроекФормы);
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначенияОтбораДанных(НастройкиОсновнойСхемы)

	ЭлементыОтбора = НастройкиОсновнойСхемы.Отбор.Элементы;
	
	ЗначенияОтбораДанных = Новый Структура;
	
	ЗначенияОтбораДанных.Вставить("СписокОрганизаций", ОтчетыУТСервер.ЗначениеОтбора("Организация", ЭлементыОтбора));
	Если ЗначенияОтбораДанных.СписокОрганизаций.Количество() = 0 Тогда
		ЗначенияОтбораДанных.СписокОрганизаций = ВнеоборотныеАктивыСлужебный.СписокРазрешенныхОрганизаций();
	КонецЕсли;
	
	ЗначенияОтбораДанных.Вставить("СписокНМА", ОтчетыУТСервер.ЗначениеОтбора("НематериальныйАктив", ЭлементыОтбора));
	ЗначенияОтбораДанных.Вставить("ДокументРасчетаАмортизации", ОтчетыУТСервер.ЗначениеОтбора("ДокументРасчетаАмортизации", ЭлементыОтбора));
	
	ОтчетыУТСервер.ПериодОтчета(НастройкиОсновнойСхемы, ЗначенияОтбораДанных);
	
	ПоказатьРасчетБУ = ОтчетыУТСервер.ЗначениеПараметра(НастройкиОсновнойСхемы, "ПоказатьРасчетБУ", Ложь);
	ПоказатьРасчетНУ = ОтчетыУТСервер.ЗначениеПараметра(НастройкиОсновнойСхемы, "ПоказатьРасчетНУ", Ложь);
	ПоказатьРасчетУУ = ОтчетыУТСервер.ЗначениеПараметра(НастройкиОсновнойСхемы, "ПоказатьРасчетУУ", Ложь);
	
	ЗначенияОтбораДанных.Вставить("ПоказатьРасчетБУ", ПоказатьРасчетБУ);
	ЗначенияОтбораДанных.Вставить("ПоказатьРасчетНУ", ПоказатьРасчетНУ);
	ЗначенияОтбораДанных.Вставить("ПоказатьРасчетУУ", ПоказатьРасчетУУ);
	
	Возврат ЗначенияОтбораДанных;
	
КонецФункции

Процедура УстановитьПараметрыОтчета(ЗначенияОтбораДанных, НастройкиОсновнойСхемы)

	Если ЗначениеЗаполнено(ЗначенияОтбораДанных.НачалоПериода) Тогда
		НачалоГода = НачалоГода(ЗначенияОтбораДанных.НачалоПериода);
	Иначе
		НачалоГода = '000101010000';
	КонецЕсли;
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОсновнойСхемы, "НачалоГода", НачалоГода);
	
	Если ЗначениеЗаполнено(ЗначенияОтбораДанных.ОкончаниеПериода) Тогда
		КонецГода = КонецГода(ЗначенияОтбораДанных.ОкончаниеПериода);
	Иначе
		КонецГода = '000101010000';
	КонецЕсли;
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОсновнойСхемы, "КонецГода", КонецГода);
	
КонецПроцедуры

Процедура УстановитьТекстЗапроса(СхемаКомпоновкиДанных)

	СписокЗапросов = Новый Массив;
	
	#Область ВТ_Амортизация
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабАмортизация.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(ТабАмортизация.Период, ГОД) КАК НачалоГода,
	|	НАЧАЛОПЕРИОДА(ТабАмортизация.Период, МЕСЯЦ) КАК НачалоМесяца,
	|	ТабАмортизация.Регистратор КАК ДокументРасчетаАмортизации,
	|
	|	ТабАмортизация.Организация КАК Организация,
	|	ТабАмортизация.Подразделение КАК Подразделение,
	|	ТабАмортизация.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|
	|	ТабАмортизация.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ТабАмортизация.Амортизация КАК АмортизацияУУ,
	|	ТабАмортизация.АмортизацияРегл + ТабАмортизация.АмортизацияЦФ КАК АмортизацияБУ,
	|	ТабАмортизация.АмортизацияНУ + ТабАмортизация.АмортизацияНУЦФ КАК АмортизацияНУ,
	|	ТабАмортизация.АмортизацияПР + ТабАмортизация.АмортизацияПРЦФ КАК АмортизацияПР,
	|	ТабАмортизация.АмортизацияВР + ТабАмортизация.АмортизацияВРЦФ КАК АмортизацияВР,
	|
	|	ТабАмортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериодУУ,
	|	ТабАмортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериодУУ,
	|
	|	ТабАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	ТабАмортизация.РесурсВыработанныйЗаТекущийПериодБУ КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|
	|	ТабАмортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииУУ,
	|	ТабАмортизация.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизацииБУ,
	|
	|	ВЫБОР
	|		КОГДА ТабАмортизация.ПорядокУчетаУУ = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПустаяСсылка)
	|				И ТабАмортизация.Амортизация <> 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)
	|		ИНАЧЕ ТабАмортизация.ПорядокУчетаУУ 
	|	КОНЕЦ КАК ПорядокУчетаУУ,
	|
	|	ВЫБОР
	|		КОГДА ТабАмортизация.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПустаяСсылка)
	|				И (ТабАмортизация.АмортизацияРегл + ТабАмортизация.АмортизацияЦФ) <> 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл)
	|		ИНАЧЕ ТабАмортизация.ПорядокУчетаБУ 
	|	КОНЕЦ КАК ПорядокУчетаБУ,
	|
	|	ВЫБОР
	|		КОГДА ТабАмортизация.ПорядокНачисленияАмортизацииУУ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.ПустаяСсылка)
	|				И ТабАмортизация.Амортизация <> 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
	|		ИНАЧЕ ТабАмортизация.ПорядокНачисленияАмортизацииУУ 
	|	КОНЕЦ КАК ПорядокНачисленияАмортизацииУУ,
	|
	|	ВЫБОР
	|		КОГДА ТабАмортизация.ПорядокНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.ПустаяСсылка)
	|				И (ТабАмортизация.АмортизацияРегл + ТабАмортизация.АмортизацияЦФ) <> 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
	|		ИНАЧЕ ТабАмортизация.ПорядокНачисленияАмортизацииБУ 
	|	КОНЕЦ КАК ПорядокНачисленияАмортизацииБУ,
	|
	|	ТабАмортизация.ЭтоДоначисление КАК ЭтоДоначислениеУУ,
	|	ТабАмортизация.ЭтоДоначислениеБУ КАК ЭтоДоначислениеБУ
	|
	|ПОМЕСТИТЬ ВТ_Амортизация
	|
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА КАК ТабАмортизация
	|
	|ГДЕ
	|	(ТабАмортизация.Период >= &НачалоПериода
	|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ТабАмортизация.Период <= &КонецПериода
	|			ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И ТабАмортизация.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
	|	И ТабАмортизация.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|{ГДЕ
	|	ТабАмортизация.Организация.* КАК Организация,
	|	ТабАмортизация.Подразделение.* КАК Подразделение,
	|	ТабАмортизация.НематериальныйАктив.* КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(ТабАмортизация.Регистратор КАК Документ.АмортизацияНМА2_4) КАК ДокументРасчетаАмортизации,
	|	ТабАмортизация.Амортизация КАК АмортизацияУУ,
	|	(ТабАмортизация.АмортизацияРегл + ТабАмортизация.АмортизацияЦФ) КАК АмортизацияБУ,
	|	(ТабАмортизация.АмортизацияНУ + ТабАмортизация.АмортизацияНУЦФ) КАК АмортизацияНУ,
	|	(ТабАмортизация.АмортизацияПР + ТабАмортизация.АмортизацияПРЦФ) КАК АмортизацияПР,
	|	(ТабАмортизация.АмортизацияВР + ТабАмортизация.АмортизацияВРЦФ) КАК АмортизацияВР}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабАмортизация.Период,
	|	НАЧАЛОПЕРИОДА(ТабАмортизация.Период, ГОД),
	|	НАЧАЛОПЕРИОДА(ТабАмортизация.Период, МЕСЯЦ),
	|	ТабАмортизация.Регистратор КАК ДокументРасчетаАмортизации,
	|
	|	ТабАмортизация.Организация,
	|	ТабАмортизация.Подразделение,
	|	ТабАмортизация.Организация.ГоловнаяОрганизация,
	|	ТабАмортизация.НематериальныйАктив,
	|
	|	ТабАмортизация.Стоимость,
	|	ТабАмортизация.СтоимостьРегл + ТабАмортизация.СтоимостьЦФ,
	|	ТабАмортизация.СтоимостьНУ + ТабАмортизация.СтоимостьНУЦФ,
	|	ТабАмортизация.СтоимостьПР + ТабАмортизация.СтоимостьПРЦФ,
	|	ТабАмортизация.СтоимостьВР + ТабАмортизация.СтоимостьВРЦФ,
	|
	|	ТабАмортизация.РесурсВыработанныйЗаПрошлыйПериод,
	|	ТабАмортизация.РесурсВыработанныйЗаТекущийПериод,
	|
	|	0,
	|	0,
	|
	|	ТабАмортизация.СтоимостьДляВычисленияАмортизации,
	|	0,
	|
	|	ТабАмортизация.ПорядокУчетаУУ КАК ПорядокУчетаУУ,
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл) КАК ПорядокУчетаБУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца) КАК ПорядокНачисленияАмортизацииУУ,
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца) КАК ПорядокНачисленияАмортизацииБУ,
	|
	|	ТабАмортизация.ЭтоДоначисление КАК ЭтоДоначисление,
	|	ЛОЖЬ КАК ЭтоДоначислениеБУ
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК ТабАмортизация
	|
	|ГДЕ
	|	(ТабАмортизация.Период >= &НачалоПериода
	|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ТабАмортизация.Период <= &КонецПериода
	|			ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И ТабАмортизация.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
	|	И ТабАмортизация.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|{ГДЕ
	|	ТабАмортизация.Организация.* КАК Организация,
	|	ТабАмортизация.Подразделение.* КАК Подразделение,
	|	ТабАмортизация.НематериальныйАктив.* КАК НематериальныйАктив,
	|	ВЫРАЗИТЬ(ТабАмортизация.Регистратор КАК Документ.АмортизацияНМА2_4) КАК ДокументРасчетаАмортизации,
	|	ТабАмортизация.Стоимость КАК АмортизацияУУ,
	|	(ТабАмортизация.СтоимостьРегл + ТабАмортизация.СтоимостьЦФ) КАК АмортизацияБУ,
	|	(ТабАмортизация.СтоимостьНУ + ТабАмортизация.СтоимостьНУЦФ) КАК АмортизацияНУ,
	|	(ТабАмортизация.СтоимостьПР + ТабАмортизация.СтоимостьПРЦФ) КАК АмортизацияПР,
	|	(ТабАмортизация.СтоимостьВР + ТабАмортизация.СтоимостьВРЦФ) КАК АмортизацияВР}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	НематериальныйАктив,
	|	Организация
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область УчетнаяПолитика
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВТ_Амортизация.Период КАК Период,
	|	ВТ_Амортизация.Организация КАК Организация,
	|	МАКСИМУМ(ТаблицаПоследнийПериод.Период) КАК ПериодСрезаПоследних
	|
	|ПОМЕСТИТЬ УчетнаяПолитикаБУ_СрезПоследних
	|
	|ИЗ
	|	ВТ_Амортизация КАК ВТ_Амортизация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета КАК ТаблицаПоследнийПериод
	|		ПО (ТаблицаПоследнийПериод.Организация = ВТ_Амортизация.Организация)
	|			И (ТаблицаПоследнийПериод.Период <= ВТ_Амортизация.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Амортизация.Период,
	|	ВТ_Амортизация.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Период КАК Период,
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаРегистраНаДату.ПорядокНачисленияАмортизацииНМА КАК ПорядокНачисленияАмортизации
	|
	|ПОМЕСТИТЬ УчетнаяПолитикаБУ
	|
	|ИЗ
	|	УчетнаяПолитикаБУ_СрезПоследних КАК ТаблицаСрезПоследних
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета КАК ТаблицаРегистраНаДату
	|		ПО (ТаблицаРегистраНаДату.Организация = ТаблицаСрезПоследних.Организация)
	|			И (ТаблицаРегистраНаДату.Период = ТаблицаСрезПоследних.ПериодСрезаПоследних)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ УчетнаяПолитикаБУ_СрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Амортизация.Период КАК Период,
	|	ВТ_Амортизация.Организация КАК Организация,
	|	МАКСИМУМ(ТаблицаПоследнийПериод.Период) КАК ПериодСрезаПоследних
	|
	|ПОМЕСТИТЬ УчетнаяПолитикаУУ_СрезПоследних
	|
	|ИЗ
	|	ВТ_Амортизация КАК ВТ_Амортизация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета КАК ТаблицаПоследнийПериод
	|		ПО (ТаблицаПоследнийПериод.Организация = ВТ_Амортизация.Организация)
	|			И (ТаблицаПоследнийПериод.Период <= ВТ_Амортизация.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Амортизация.Период,
	|	ВТ_Амортизация.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Период КАК Период,
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаРегистраНаДату.ПорядокНачисленияАмортизацииНМА КАК ПорядокНачисленияАмортизации
	|
	|ПОМЕСТИТЬ УчетнаяПолитикаУУ
	|
	|ИЗ
	|	УчетнаяПолитикаУУ_СрезПоследних КАК ТаблицаСрезПоследних
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета КАК ТаблицаРегистраНаДату
	|		ПО (ТаблицаРегистраНаДату.Организация = ТаблицаСрезПоследних.Организация)
	|			И (ТаблицаРегистраНаДату.Период = ТаблицаСрезПоследних.ПериодСрезаПоследних)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ УчетнаяПолитикаУУ_СрезПоследних";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПериодыПараметровБУ
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА (Амортизация.ПорядокНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|				ИЛИ Амортизация.ПорядокНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.ПустаяСсылка)
	|					 И ЕСТЬNULL(УчетнаяПолитикаБУ.ПорядокНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|			ТОГДА Амортизация.Период
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Амортизация.Период, МЕСЯЦ, -1), МЕСЯЦ)
	|	КОНЕЦ КАК ПериодПараметров,
	|	КОНЕЦПЕРИОДА(Амортизация.Период, МЕСЯЦ) КАК КонецПериодаПараметров,
	|	Амортизация.Период КАК Период,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив
	|
	|ПОМЕСТИТЬ ПериодыПараметровБУ
	|
	|ИЗ
	|	ВТ_Амортизация КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаБУ КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = Амортизация.Организация
	|			И УчетнаяПолитикаБУ.Период = Амортизация.Период
	|ГДЕ
	|	(Амортизация.АмортизацияБУ <> 0
	|			ИЛИ Амортизация.АмортизацияНУ <> 0
	|			ИЛИ Амортизация.АмортизацияПР <> 0
	|			ИЛИ Амортизация.АмортизацияВР <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация,
	|	ГоловнаяОрганизация,
	|	ПериодПараметров";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область ПериодыПараметровУУ
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА (Амортизация.ПорядокНачисленияАмортизацииУУ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|				ИЛИ Амортизация.ПорядокНачисленияАмортизацииУУ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.ПустаяСсылка)
	|						И ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|			ТОГДА Амортизация.Период
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Амортизация.Период, МЕСЯЦ, -1), МЕСЯЦ)
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	КОНЕЦПЕРИОДА(Амортизация.Период, МЕСЯЦ) КАК КонецПериодаПараметров,
	|	Амортизация.Период КАК Период,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив
	|
	|ПОМЕСТИТЬ ПериодыПараметровУУ
	|
	|ИЗ
	|	ВТ_Амортизация КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаУУ КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = Амортизация.Организация
	|			И УчетнаяПолитика.Период = Амортизация.Период
	|ГДЕ
	|	Амортизация.АмортизацияУУ <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация,
	|	ПериодПараметров";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПериодыПараметровНаНачалоМесяца
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Амортизация.Период, МЕСЯЦ, -1), МЕСЯЦ) КАК ПериодПараметров,
	|	КОНЕЦПЕРИОДА(Амортизация.Период, МЕСЯЦ) КАК КонецПериодаПараметров,
	|	Амортизация.Период КАК Период,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив
	|
	|ПОМЕСТИТЬ ПериодыПараметровНаНачалоМесяца
	|
	|ИЗ
	|	ВТ_Амортизация КАК Амортизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация,
	|	ПериодПараметров";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПараметрыРасчета
	
	// УУ
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПервоначальныеСведенияНМА", "ПервоначальныеСведенияУУ", "ПериодыПараметровУУ", "НематериальныйАктив", СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПорядокУчетаНМА", "ПорядокУчетаУпр", "ПериодыПараметровУУ", "НематериальныйАктив", СписокЗапросов);
		
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПараметрыАмортизацииНМАУУ", "ПараметрыАмортизацииУУ", "ПериодыПараметровУУ", "НематериальныйАктив", СписокЗапросов);
		
	// БУ
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПервоначальныеСведенияНМА", "ПервоначальныеСведенияБУ", "ПериодыПараметровБУ", "НематериальныйАктив", СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПорядокУчетаНМА", "ПорядокУчетаРегл", "ПериодыПараметровБУ", "НематериальныйАктив", СписокЗапросов);
		
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПараметрыАмортизацииНМАБУ", "ПараметрыАмортизацииБУ", "ПериодыПараметровБУ", "НематериальныйАктив", СписокЗапросов);
		
	// НУ
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПервоначальныеСведенияНМА", "ПервоначальныеСведенияНУ", "ПериодыПараметровНаНачалоМесяца", "НематериальныйАктив", СписокЗапросов);
	
	ВнеоборотныеАктивыСлужебный.ДобавитьТекстЗапросаТаблицыСправкиРасчетАмортизации(
		"ПараметрыАмортизацииНМАБУ", "ПараметрыАмортизацииНУ", "ПериодыПараметровНаНачалоМесяца", "НематериальныйАктив", СписокЗапросов);
		
	#КонецОбласти

	#Область Выработка
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ПервоначальныеСведенияБУ.ДатаПринятияКУчетуБУ) = МЕСЯЦ(&НачалоМесяца) - 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПринятоКУчетуВПрошломМесяце
	|
	|ПОМЕСТИТЬ ВТ_СписокНМА_Выработка
	|
	|ИЗ
	|	ВТ_Амортизация КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияБУ КАК ПервоначальныеСведенияБУ
	|		ПО (ПервоначальныеСведенияБУ.Организация = Амортизация.Организация)
	|			И (ПервоначальныеСведенияБУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПервоначальныеСведенияБУ.Период = Амортизация.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииУУ КАК ПараметрыАмортизацииУУ
	|		ПО (ПараметрыАмортизацииУУ.Организация = Амортизация.Организация)
	|			И (ПараметрыАмортизацииУУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПараметрыАмортизацииУУ.Период = Амортизация.НачалоМесяца)
	|
	|ГДЕ
	|	(ПервоначальныеСведенияБУ.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции)
	|			ИЛИ ПараметрыАмортизацииУУ.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВыработкаНМА.Период, МЕСЯЦ) КАК Период,
	|	ВыработкаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	ВыработкаНМА.КоличествоОборот КАК ОбъемВыработки
	|
	|ПОМЕСТИТЬ ВыработкаНМА
	|
	|ИЗ
	|	РегистрНакопления.ВыработкаНМА.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокНМА.НематериальныйАктив
	|				ИЗ
	|					ВТ_СписокНМА_Выработка КАК СписокНМА)) КАК ВыработкаНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СписокНМА_Выработка
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область СтоимостьАмортизация_НаНачалоМесяца
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьНМА.Период КАК Период,
	|	СтоимостьНМА.Организация КАК Организация,
	|	СтоимостьНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	СтоимостьНМА.СтоимостьКонечныйОстаток КАК СтоимостьУУ,
	|	СтоимостьНМА.СтоимостьРеглКонечныйОстаток + СтоимостьНМА.СтоимостьЦФКонечныйОстаток КАК СтоимостьБУ,
	|	СтоимостьНМА.СтоимостьНУКонечныйОстаток + СтоимостьНМА.СтоимостьНУЦФКонечныйОстаток КАК СтоимостьНУ
	|
	|ПОМЕСТИТЬ ВТ_СтоимостьНМА_ЗаПериод
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА.ОстаткиИОбороты(
	|			&НачалоПрошлогоПериода {(&НачалоПрошлогоПериода)},
	|			&КонецПериода {(&КонецПериода)},
	|			Месяц,
	|			,
	|			НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					Амортизация.НематериальныйАктив
	|				ИЗ
	|					ВТ_Амортизация КАК Амортизация)) КАК СтоимостьНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Амортизация.Период КАК Период,
	|	ВТ_Амортизация.Организация КАК Организация,
	|	ВТ_Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|	МАКСИМУМ(ВТ_СтоимостьНМА_ЗаПериод.Период) КАК ПериодСрезаПоследних
	|
	|ПОМЕСТИТЬ ВТ_СтоимостьНМА_НаНачалоМесяца_СрезПоследних
	|
	|ИЗ
	|	ВТ_Амортизация КАК ВТ_Амортизация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА_ЗаПериод КАК ВТ_СтоимостьНМА_ЗаПериод
	|		ПО (ВТ_СтоимостьНМА_ЗаПериод.НематериальныйАктив = ВТ_Амортизация.НематериальныйАктив)
	|			И (ВТ_СтоимостьНМА_ЗаПериод.Организация = ВТ_Амортизация.Организация)
	|			И (ВТ_СтоимостьНМА_ЗаПериод.Период < ВТ_Амортизация.НачалоМесяца)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Амортизация.Период,
	|	ВТ_Амортизация.Организация,
	|	ВТ_Амортизация.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация,
	|	ПериодСрезаПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоследнийПериод.Период КАК Период,
	|	ТаблицаПоследнийПериод.Организация КАК Организация,
	|	ТаблицаПоследнийПериод.НематериальныйАктив КАК НематериальныйАктив,
	|	ТаблицаРегистраНаДату.СтоимостьУУ КАК СтоимостьУУ,
	|	ТаблицаРегистраНаДату.СтоимостьБУ КАК СтоимостьБУ,
	|	ТаблицаРегистраНаДату.СтоимостьНУ КАК СтоимостьНУ
	|
	|ПОМЕСТИТЬ ВТ_СтоимостьНМА_НаНачалоМесяца
	|
	|ИЗ
	|	ВТ_СтоимостьНМА_НаНачалоМесяца_СрезПоследних КАК ТаблицаПоследнийПериод
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА_ЗаПериод КАК ТаблицаРегистраНаДату
	|		ПО (ТаблицаРегистраНаДату.НематериальныйАктив = ТаблицаПоследнийПериод.НематериальныйАктив)
	|			И (ТаблицаРегистраНаДату.Организация = ТаблицаПоследнийПериод.Организация)
	|			И (ТаблицаРегистраНаДату.Период = ТаблицаПоследнийПериод.ПериодСрезаПоследних)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СтоимостьНМА_ЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СтоимостьНМА_НаНачалоМесяца_СрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияНМА.Период КАК Период,
	|	АмортизацияНМА.Организация КАК Организация,
	|	АмортизацияНМА.НематериальныйАктив КАК НематериальныйАктив,
	|	-АмортизацияНМА.АмортизацияКонечныйОстаток КАК АмортизацияУУ,
	|	-(АмортизацияНМА.АмортизацияРеглКонечныйОстаток + АмортизацияНМА.АмортизацияЦФКонечныйОстаток) КАК АмортизацияБУ,
	|	-(АмортизацияНМА.АмортизацияНУКонечныйОстаток + АмортизацияНМА.АмортизацияНУЦФКонечныйОстаток) КАК АмортизацияНУ
	|
	|ПОМЕСТИТЬ ВТ_АмортизацияНМА_ЗаПериод
	|
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА.ОстаткиИОбороты(
	|			&НачалоПрошлогоПериода {(&НачалоПрошлогоПериода)},
	|			&КонецПериода {(&КонецПериода)},
	|			Месяц,
	|			,
	|			НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					Амортизация.НематериальныйАктив
	|				ИЗ
	|					ВТ_Амортизация КАК Амортизация)) КАК АмортизацияНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Амортизация.Период КАК Период,
	|	ВТ_Амортизация.Организация КАК Организация,
	|	ВТ_Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|	МАКСИМУМ(ВТ_АмортизацияНМА_ЗаПериод.Период) КАК ПериодСрезаПоследних
	|
	|ПОМЕСТИТЬ ВТ_АмортизацияНМА_НаНачалоМесяца_СрезПоследних
	|
	|ИЗ
	|	ВТ_Амортизация КАК ВТ_Амортизация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМА_ЗаПериод КАК ВТ_АмортизацияНМА_ЗаПериод
	|		ПО (ВТ_АмортизацияНМА_ЗаПериод.НематериальныйАктив = ВТ_Амортизация.НематериальныйАктив)
	|			И (ВТ_АмортизацияНМА_ЗаПериод.Организация = ВТ_Амортизация.Организация)
	|			И (ВТ_АмортизацияНМА_ЗаПериод.Период < ВТ_Амортизация.НачалоМесяца)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Амортизация.Период,
	|	ВТ_Амортизация.Организация,
	|	ВТ_Амортизация.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация,
	|	ПериодСрезаПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоследнийПериод.Период КАК Период,
	|	ТаблицаПоследнийПериод.Организация КАК Организация,
	|	ТаблицаПоследнийПериод.НематериальныйАктив КАК НематериальныйАктив,
	|	ТаблицаРегистраНаДату.АмортизацияУУ КАК АмортизацияУУ,
	|	ТаблицаРегистраНаДату.АмортизацияБУ КАК АмортизацияБУ,
	|	ТаблицаРегистраНаДату.АмортизацияНУ КАК АмортизацияНУ
	|
	|ПОМЕСТИТЬ ВТ_АмортизацияНМА_НаНачалоМесяца
	|
	|ИЗ
	|	ВТ_АмортизацияНМА_НаНачалоМесяца_СрезПоследних КАК ТаблицаПоследнийПериод
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМА_ЗаПериод КАК ТаблицаРегистраНаДату
	|		ПО (ТаблицаРегистраНаДату.НематериальныйАктив = ТаблицаПоследнийПериод.НематериальныйАктив)
	|			И (ТаблицаРегистраНаДату.Организация = ТаблицаПоследнийПериод.Организация)
	|			И (ТаблицаРегистраНаДату.Период = ТаблицаПоследнийПериод.ПериодСрезаПоследних)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_АмортизацияНМА_ЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_АмортизацияНМА_НаНачалоМесяца_СрезПоследних
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВТ_НастройкиУчетаНалогаНаПрибыль
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПериодыПараметров.Период КАК Период,
	|	ПериодыПараметров.Организация КАК Организация,
	|	ПериодыПараметров.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	МАКСИМУМ(ТаблицаПоследнийПериод.Период) КАК ПериодСрезаПоследних
	|
	|ПОМЕСТИТЬ НастройкиУчетаНалогаНаПрибыль_СрезПоследних
	|
	|ИЗ
	|	ПериодыПараметровНаНачалоМесяца КАК ПериодыПараметров
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль КАК ТаблицаПоследнийПериод
	|		ПО (ТаблицаПоследнийПериод.Организация = ПериодыПараметров.ГоловнаяОрганизация)
	|			И (ТаблицаПоследнийПериод.Период <= ПериодыПараметров.КонецПериодаПараметров)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыПараметров.Период,
	|	ПериодыПараметров.Организация,
	|	ПериодыПараметров.ГоловнаяОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ГоловнаяОрганизация,
	|	ПериодСрезаПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Период КАК Период,
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаРегистраНаДату.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ
	|
	|ПОМЕСТИТЬ НастройкиУчетаНалогаНаПрибыль
	|
	|ИЗ
	|	НастройкиУчетаНалогаНаПрибыль_СрезПоследних КАК ТаблицаСрезПоследних
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль КАК ТаблицаРегистраНаДату
	|		ПО (ТаблицаРегистраНаДату.Организация = ТаблицаСрезПоследних.ГоловнаяОрганизация)
	|			И (ТаблицаРегистраНаДату.Период = ТаблицаСрезПоследних.ПериодСрезаПоследних)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Период;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиУчетаНалогаНаПрибыль_СрезПоследних";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВТ_АмортизацияНМАПриПереходеКЛинейномуМетоду
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НелинейныйМетод.Организация КАК Организация,
	|	ЕСТЬNULL(МИНИМУМ(ЛинейныйМетод.Период), ДАТАВРЕМЯ(2009, 1, 1)) КАК Дата
	|
	|ПОМЕСТИТЬ ДатыПереходаКЛинейномуМетоду
	|
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(
	|		&КонецПериода{&КонецПериода}, 
	|		МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)) КАК НелинейныйМетод
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль КАК ЛинейныйМетод
	|		ПО ЛинейныйМетод.Организация = НелинейныйМетод.Организация
	|			И ЛинейныйМетод.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|			И ЛинейныйМетод.Период >= ДАТАВРЕМЯ(2009, 1, 1)
	|			И ЛинейныйМетод.Период > НелинейныйМетод.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НелинейныйМетод.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияНМА.Организация КАК Организация,
	|	АмортизацияНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	СУММА(ВЫБОР КОГДА АмортизацияНМА.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА -АмортизацияНМА.АмортизацияНУ
	|		ИНАЧЕ АмортизацияНМА.АмортизацияНУ
	|	КОНЕЦ) КАК АмортизацияНУ
	|
	|ПОМЕСТИТЬ ВТ_АмортизацияНМАПриПереходеКЛинейномуМетоду
	|
	|ИЗ
	|
	|	ДатыПереходаКЛинейномуМетоду КАК ДатыПереходаКЛинейномуМетоду
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК АмортизацияНМА
	|		ПО АмортизацияНМА.Организация.ГоловнаяОрганизация = ДатыПереходаКЛинейномуМетоду.Организация
	|			И АмортизацияНМА.Период < ДатыПереходаКЛинейномуМетоду.Дата
	|			И АмортизацияНМА.Активность
	|
	|ГДЕ
	|	ДатыПереходаКЛинейномуМетоду.Дата > ДАТАВРЕМЯ(2009, 1, 1)
	|	И (АмортизацияНМА.Организация, АмортизацияНМА.НематериальныйАктив) В
	|			(ВЫБРАТЬ
	|				СписокНМА.Организация,
	|				СписокНМА.НематериальныйАктив
	|			ИЗ
	|				ВТ_Амортизация КАК СписокНМА)
	|
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияНМА.Организация,
	|	АмортизацияНМА.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НематериальныйАктив,
	|	Организация";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область Амортизация
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Амортизация.Период КАК Период,
	|	Амортизация.Период КАК ПериодУУ,
	|	Амортизация.Период КАК ПериодБУ,
	|	Амортизация.ДокументРасчетаАмортизации КАК ДокументРасчетаАмортизации,
	|
	|	Амортизация.ЭтоДоначислениеУУ ИЛИ Амортизация.ЭтоДоначислениеБУ КАК ЭтоДоначисление,
	|
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.Подразделение КАК Подразделение,
	|	Амортизация.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ЕСТЬNULL(ВыработкаНМА.ОбъемВыработки, 0) КАК ВыработкаЗаМесяц,
	|	ЕСТЬNULL(ПорядокУчетаУпр.ОбъемНаработки, ПорядокУчетаРегл.ОбъемНаработки) КАК ОбъемНаработки,
	|
	// Параметры УУ
	|	Амортизация.АмортизацияУУ КАК АмортизацияУУ,
	|
	|	Амортизация.ЭтоДоначислениеУУ КАК ЭтоДоначислениеУУ,
	|	Амортизация.ПорядокУчетаУУ КАК ПорядокУчетаУУ,
	|
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериодУУ КАК РесурсВыработанныйЗаПрошлыйПериодУУ,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериодУУ КАК РесурсВыработанныйЗаТекущийПериодУУ,
	|	Амортизация.СтоимостьДляВычисленияАмортизацииУУ КАК СтоимостьДляВычисленияАмортизацииУУ,
	|
	|	ПараметрыАмортизацииУУ.МетодНачисленияАмортизации КАК МетодНачисленияАмортизацииУУ,
	|	ПервоначальныеСведенияУУ.ПервоначальнаяСтоимостьУУ КАК ПервоначальнаяСтоимостьУУ,
	|	ПараметрыАмортизацииУУ.СрокИспользования КАК СрокПолезногоИспользованияУУ,
	|	ПараметрыАмортизацииУУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииУУ,
	|	ПараметрыАмортизацииУУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииУУ,
	|	ПараметрыАмортизацииУУ.КоэффициентУскорения КАК КоэффициентУскоренияУУ,
	|	ПараметрыАмортизацииУУ.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|
	|	ЕСТЬNULL(СтоимостьНаНачалоМесяца.СтоимостьУУ, 0) - ЕСТЬNULL(АмортизацияНаНачалоМесяца.АмортизацияУУ, 0) КАК ОстаточнаяСтоимостьУУ,
	|
	|	(ГОД(Амортизация.Период) - ГОД(НАЧАЛОПЕРИОДА(ПервоначальныеСведенияУУ.ДатаПринятияКУчетуУУ, МЕСЯЦ))) * 12 
	|		+ МЕСЯЦ(Амортизация.Период) - МЕСЯЦ(НАЧАЛОПЕРИОДА(ПервоначальныеСведенияУУ.ДатаПринятияКУчетуУУ, МЕСЯЦ)) КАК ФактическийСрокИспользованияУУ,
	|
	// Параметры БУ
	|	Амортизация.АмортизацияБУ КАК АмортизацияБУ,
	|	Амортизация.АмортизацияПР КАК АмортизацияПР,
	|	Амортизация.АмортизацияВР КАК АмортизацияВР,
	|
	|	Амортизация.ЭтоДоначислениеБУ КАК ЭтоДоначислениеБУ,
	|	Амортизация.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериодБУ КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериодБУ КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|	Амортизация.СтоимостьДляВычисленияАмортизацииБУ КАК СтоимостьДляВычисленияАмортизацииБУ,
	|
	|	ПервоначальныеСведенияБУ.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияБУ.ПервоначальнаяСтоимостьБУ КАК ПервоначальнаяСтоимостьБУ,
	|	ПараметрыАмортизацииБУ.СрокПолезногоИспользованияБУ КАК СрокПолезногоИспользованияБУ,
	|	ПараметрыАмортизацииБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииБУ,
	|	ПараметрыАмортизацииБУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииБУ,
	|	ПараметрыАмортизацииБУ.КоэффициентБУ КАК КоэффициентБУ,
	|	ПараметрыАмортизацииБУ.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	ЕСТЬNULL(СтоимостьНаНачалоМесяца.СтоимостьБУ, 0) - ЕСТЬNULL(АмортизацияНаНачалоМесяца.АмортизацияБУ, 0) КАК ОстаточнаяСтоимостьБУ,
	|
	|	(ГОД(Амортизация.Период) - ГОД(НАЧАЛОПЕРИОДА(ПервоначальныеСведенияБУ.ДатаПринятияКУчетуБУ, МЕСЯЦ))) * 12 
	|		+ МЕСЯЦ(Амортизация.Период) - МЕСЯЦ(НАЧАЛОПЕРИОДА(ПервоначальныеСведенияБУ.ДатаПринятияКУчетуБУ, МЕСЯЦ)) КАК ФактическийСрокИспользованияБУ,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияБУ.ДатаПринятияКУчетуБУ) <> ГОД(Амортизация.НачалоМесяца)
	|			ТОГДА 13 - МЕСЯЦ(ПервоначальныеСведенияБУ.ДатаПринятияКУчетуБУ) + 12 * (ГОД(Амортизация.НачалоМесяца) - ГОД(ПервоначальныеСведенияБУ.ДатаПринятияКУчетуБУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛетБУ,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ПервоначальныеСведенияУУ.ДатаПринятияКУчетуУУ) <> ГОД(Амортизация.НачалоМесяца)
	|			ТОГДА 13 - МЕСЯЦ(ПервоначальныеСведенияУУ.ДатаПринятияКУчетуУУ) + 12 * (ГОД(Амортизация.НачалоМесяца) - ГОД(ПервоначальныеСведенияУУ.ДатаПринятияКУчетуУУ) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛетУУ,
	|
	// Параметры НУ
	|	Амортизация.АмортизацияНУ КАК АмортизацияНУ,
	|
	|	ВЫБОР
	|		КОГДА НематериальныеАктивы.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НематериальныеАктивы.АмортизационнаяГруппа В (
	|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), 
	|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), 
	|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа), 
	|								ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа))
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|				ИНАЧЕ ЕСТЬNULL(НастройкиУчетаНалогаНаПрибыль.МетодНачисленияАмортизацииНУ, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный))
	|		КОНЕЦ
	|	КОНЕЦ КАК МетодНачисленияАмортизацииНУ,
	|
	|	ПараметрыАмортизацииНУ.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользованияНУ,
	|
	|	ВЫБОР
	|		КОГДА НематериальныеАктивы.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииНУ.СпециальныйКоэффициент, 1)
	|	КОНЕЦ КАК СпециальныйКоэффициентНУ,
	|
	|	&НормаАмортизации КАК НормаАмортизации,
	|
	|	ЕСТЬNULL(СтоимостьНаНачалоМесяца.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияНаНачалоМесяца.АмортизацияНУ, 0) КАК ОстаточнаяСтоимостьНУ,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) = 2009
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияНУ.ФактическийСрокИспользованияДо2009, 0)
	|		КОГДА ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1)) <= ЕСТЬNULL(ПервоначальныеСведенияНУ.ДатаПринятияКУчетуНУ, ДАТАВРЕМЯ(1,1,1))
	|			ТОГДА 0
	|		ИНАЧЕ (ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) - ГОД(ПервоначальныеСведенияНУ.ДатаПринятияКУчетуНУ)) * 12 
	|			+ (МЕСЯЦ(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) - МЕСЯЦ(ПервоначальныеСведенияНУ.ДатаПринятияКУчетуНУ)) - 1
	|	КОНЕЦ КАК ФактическийСрокПриПереходеКЛинейномуМетоду,
	|
	|	ВЫБОР
	|		КОГДА ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) = 2009
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияНУ.АмортизацияДо2009, 0)
	|		КОГДА ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1)) <= ЕСТЬNULL(ПервоначальныеСведенияНУ.ДатаПринятияКУчетуНУ, ДАТАВРЕМЯ(1,1,1))
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(АмортизацияНМАПриПереходеКЛинейномуМетоду.АмортизацияНУ, 0)
	|	КОНЕЦ КАК АмортизацияПриПереходеКЛинейномуМетоду,
	|
	|	ВЫБОР
	|		КОГДА НематериальныеАктивы.ВидОбъектаУчета = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР)
	|			ТОГДА ПервоначальныеСведенияНУ.ПервоначальнаяСтоимостьНУ
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНаНачалоМесяца.СтоимостьНУ, 0)
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизацииНУ
	|
	|ИЗ
	|	ВТ_Амортизация КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НематериальныеАктивы КАК НематериальныеАктивы
	|		ПО (НематериальныеАктивы.Ссылка = Амортизация.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияУУ КАК ПервоначальныеСведенияУУ
	|		ПО (ПервоначальныеСведенияУУ.Период = Амортизация.Период)
	|			И (ПервоначальныеСведенияУУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПервоначальныеСведенияУУ.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияБУ КАК ПервоначальныеСведенияБУ
	|		ПО (ПервоначальныеСведенияБУ.Период = Амортизация.Период)
	|			И (ПервоначальныеСведенияБУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПервоначальныеСведенияБУ.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияНУ КАК ПервоначальныеСведенияНУ
	|		ПО (ПервоначальныеСведенияНУ.Период = Амортизация.Период)
	|			И (ПервоначальныеСведенияНУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПервоначальныеСведенияНУ.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииУУ КАК ПараметрыАмортизацииУУ
	|		ПО (ПараметрыАмортизацииУУ.Период = Амортизация.Период)
	|			И (ПараметрыАмортизацииУУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПараметрыАмортизацииУУ.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииБУ КАК ПараметрыАмортизацииБУ
	|		ПО (ПараметрыАмортизацииБУ.Период = Амортизация.Период)
	|			И (ПараметрыАмортизацииБУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПараметрыАмортизацииБУ.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииНУ КАК ПараметрыАмортизацииНУ
	|		ПО (ПараметрыАмортизацииНУ.Период = Амортизация.Период)
	|			И (ПараметрыАмортизацииНУ.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПараметрыАмортизацииНУ.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаУпр КАК ПорядокУчетаУпр
	|		ПО (ПорядокУчетаУпр.Период = Амортизация.Период)
	|			И (ПорядокУчетаУпр.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПорядокУчетаУпр.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаРегл КАК ПорядокУчетаРегл
	|		ПО (ПорядокУчетаРегл.Период = Амортизация.Период)
	|			И (ПорядокУчетаРегл.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|			И (ПорядокУчетаРегл.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаНМА КАК ВыработкаНМА
	|		ПО (ВыработкаНМА.Период = Амортизация.НачалоМесяца)
	|			И (ВыработкаНМА.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА_НаНачалоМесяца КАК СтоимостьНаНачалоМесяца
	|		ПО (СтоимостьНаНачалоМесяца.Период = Амортизация.Период)
	|			И (СтоимостьНаНачалоМесяца.Организация = Амортизация.Организация)
	|			И (СтоимостьНаНачалоМесяца.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМА_НаНачалоМесяца КАК АмортизацияНаНачалоМесяца
	|		ПО (АмортизацияНаНачалоМесяца.Период = Амортизация.Период)
	|			И (АмортизацияНаНачалоМесяца.Организация = Амортизация.Организация)
	|			И (АмортизацияНаНачалоМесяца.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПереходаКЛинейномуМетоду КАК ДатыПереходаКЛинейномуМетоду
	|		ПО (ДатыПереходаКЛинейномуМетоду.Организация = Амортизация.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМАПриПереходеКЛинейномуМетоду КАК АмортизацияНМАПриПереходеКЛинейномуМетоду
	|		ПО (АмортизацияНМАПриПереходеКЛинейномуМетоду.Организация = Амортизация.Организация)
	|			И (АмортизацияНМАПриПереходеКЛинейномуМетоду.НематериальныйАктив = Амортизация.НематериальныйАктив)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиУчетаНалогаНаПрибыль КАК НастройкиУчетаНалогаНаПрибыль
	|		ПО (НастройкиУчетаНалогаНаПрибыль.Период = Амортизация.Период)
	|			И (НастройкиУчетаНалогаНаПрибыль.Организация = Амортизация.Организация)	
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&НормаАмортизации", 
		РасчетАмортизацииНМАЛокализация.ТекстПоляНормаАмортизации("НематериальныеАктивы.АмортизационнаяГруппа"));
		
	СхемаКомпоновкиДанных.НаборыДанных.Амортизация.Запрос = ТекстЗапроса;
	
КонецПроцедуры

Процедура УстановитьПериодОтчета(Форма, КомпоновщикНастроекФормы)

	ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроекФормы, "ПериодОтчета"); 
	ПараметрПериод = ПараметрПериод.Значение; // СтандартныйПериод - 
		
	Если Форма.Параметры.КлючНазначенияИспользования = "СправкаРасчетПоДокументуАмортизацииНМА" Тогда
		
		ДокументРасчетаАмортизации = ОтчетыУТСервер.ЗначениеОтбора(
										"ДокументРасчетаАмортизации", 
										КомпоновщикНастроекФормы.Настройки.Отбор.Элементы);
										
		Если ЗначениеЗаполнено(ДокументРасчетаАмортизации) Тогда
			ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРасчетаАмортизации[0], "Дата");
			ПараметрПериод.ДатаНачала = НачалоМесяца(ДатаДокумента);
			ПараметрПериод.ДатаОкончания = КонецМесяца(ДатаДокумента);
		КонецЕсли; 
		
	Иначе	
		
		Если НЕ ЗначениеЗаполнено(ПараметрПериод.ДатаНачала) Тогда
			
			ПараметрПериод.ДатаНачала = Константы.ДатаНачалаУчетаВнеоборотныхАктивов2_4.Получить();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДобавитьИнформационноеСообщениеВШапку(ТабДок, ЗначенияОтбораДанных)

	СписокПроблем = Новый Массив;
	
	ПроверитьАктуальностьРасчетаАмортизации(ЗначенияОтбораДанных, СписокПроблем);
	ПроверитьНаличиеПараметровРасчетаАмортизации(ЗначенияОтбораДанных, СписокПроблем);
	
	Если СписокПроблем.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СписокПроблем = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(СписокПроблем);
	
	ТекстСообщения = СтрСоединить(СписокПроблем, Символы.ПС);

	ТабДок.Область("R1C1").Текст = ТекстСообщения;
	ТабДок.Область("R1C1").ЦветТекста = Метаданные.ЭлементыСтиля.ЦветТекстаПроблема.Значение;
	ТабДок.Область(1, 1, 1, ).ВысотаСтроки = 0;
	
КонецПроцедуры

Процедура ПроверитьАктуальностьРасчетаАмортизации(ЗначенияОтбораДанных, СписокПроблем)

	РегистрыСведений.ПакетыАмортизацииНМА.СоздатьПакетыАмортизации(ЗначенияОтбораДанных.СписокОрганизаций);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументАмортизация.Организация.Представление КАК ОрганизацияПредставление
	|ИЗ
	|	Документ.АмортизацияНМА2_4 КАК ДокументАмортизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияКРасчетуАмортизацииНМА КАК ЗаданияКРасчету
	|		ПО (ЗаданияКРасчету.Организация = ДокументАмортизация.Организация)
	|			И (ЗаданияКРасчету.Месяц <= ДокументАмортизация.Дата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииНМА КАК ПакетыАмортизацииНМА
	|		ПО ПакетыАмортизацииНМА.Организация = ЗаданияКРасчету.Организация
	|			И ПакетыАмортизацииНМА.НомерПакета = ЗаданияКРасчету.НомерПакета
	|			И &ОтборПоСпискуНМА
	|ГДЕ
	|	ДокументАмортизация.Организация В(&СписокОрганизаций)
	|	И (НЕ &ОтборПоСпискуНМА ИЛИ ПакетыАмортизацииНМА.НематериальныйАктив В(&СписокНМА))
	|	И (НЕ &ОтборПоДокументу ИЛИ ДокументАмортизация.Ссылка В(&ДокументРасчетаАмортизации))
	|	И ДокументАмортизация.Проведен
	|	И (ДокументАмортизация.Дата >= &НачалоПериода
	|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДокументАмортизация.Дата <= &ОкончаниеПериода
	|			ИЛИ &ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокОрганизаций", ЗначенияОтбораДанных.СписокОрганизаций);
	Запрос.УстановитьПараметр("НачалоПериода", ЗначенияОтбораДанных.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ЗначенияОтбораДанных.ОкончаниеПериода);
	Запрос.УстановитьПараметр("СписокНМА", ЗначенияОтбораДанных.СписокНМА);
	Запрос.УстановитьПараметр("ОтборПоСпискуНМА", ЗначениеЗаполнено(ЗначенияОтбораДанных.СписокНМА));
	Запрос.УстановитьПараметр("ДокументРасчетаАмортизации", ЗначенияОтбораДанных.ДокументРасчетаАмортизации);
	Запрос.УстановитьПараметр("ОтборПоДокументу", ЗначениеЗаполнено(ЗначенияОтбораДанных.ДокументРасчетаАмортизации));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	СписокПроблем.Добавить(НСтр("ru = 'Расчет амортизации не актуален:'"));
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = НСтр("ru = '- для организации ""%1"" необходимо выполнить закрытие месяца'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ОрганизацияПредставление);
		СписокПроблем.Добавить(ТекстСообщения); 
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПараметровРасчетаАмортизации(ЗначенияОтбораДанных, СписокПроблем)

	Если НЕ ЗначенияОтбораДанных.ПоказатьРасчетУУ Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	АмортизацияЗаписи.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА КАК АмортизацияЗаписи
	|ГДЕ
	|	АмортизацияЗаписи.Организация В(&СписокОрганизаций)
	|	И (НЕ &ОтборПоСпискуНМА ИЛИ АмортизацияЗаписи.НематериальныйАктив В(&СписокНМА))
	|	И (НЕ &ОтборПоДокументу ИЛИ АмортизацияЗаписи.Регистратор В(&ДокументРасчетаАмортизации))
	|	И АмортизацияЗаписи.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
	|	И АмортизацияЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (АмортизацияЗаписи.Период >= &НачалоПериода
	|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (АмортизацияЗаписи.Период <= &ОкончаниеПериода
	|			ИЛИ &ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И АмортизацияЗаписи.РесурсВыработанныйЗаТекущийПериод = 0
	|	И АмортизацияЗаписи.СтоимостьДляВычисленияАмортизации = 0
	|	И АмортизацияЗаписи.Амортизация <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	АмортизацияЗаписи.Регистратор
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК АмортизацияЗаписи
	|ГДЕ
	|	АмортизацияЗаписи.Организация В(&СписокОрганизаций)
	|	И (НЕ &ОтборПоСпискуНМА ИЛИ АмортизацияЗаписи.НематериальныйАктив В(&СписокНМА))
	|	И (НЕ &ОтборПоДокументу ИЛИ АмортизацияЗаписи.Регистратор В(&ДокументРасчетаАмортизации))
	|	И АмортизацияЗаписи.Регистратор ССЫЛКА Документ.АмортизацияНМА2_4
	|	И АмортизацияЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (АмортизацияЗаписи.Период >= &НачалоПериода
	|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (АмортизацияЗаписи.Период <= &ОкончаниеПериода
	|			ИЛИ &ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И АмортизацияЗаписи.РесурсВыработанныйЗаТекущийПериод = 0
	|	И АмортизацияЗаписи.СтоимостьДляВычисленияАмортизации = 0
	|	И АмортизацияЗаписи.Стоимость <> 0";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокОрганизаций", ЗначенияОтбораДанных.СписокОрганизаций);
	Запрос.УстановитьПараметр("НачалоПериода", ЗначенияОтбораДанных.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ЗначенияОтбораДанных.ОкончаниеПериода);
	Запрос.УстановитьПараметр("СписокНМА", ЗначенияОтбораДанных.СписокНМА);
	Запрос.УстановитьПараметр("ОтборПоСпискуНМА", ЗначениеЗаполнено(ЗначенияОтбораДанных.СписокНМА));
	Запрос.УстановитьПараметр("ДокументРасчетаАмортизации", ЗначенияОтбораДанных.ДокументРасчетаАмортизации);
	Запрос.УстановитьПараметр("ОтборПоДокументу", ЗначениеЗаполнено(ЗначенияОтбораДанных.ДокументРасчетаАмортизации));
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Параметры расчета амортизации УУ могут быть незаполнены (подробнее см. справку)'");
		СписокПроблем.Добавить(ТекстСообщения); 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
